{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"compact-size-enabled":true,"size_heading":140,"size_heading_mobile":100,"color-body-text":"rgba(0,0,0,0)","color-bg-overlay":"rgba(0,0,0,0)","color-overlay-opacity":100,"margin-top":40,"margin-bottom":0}},"instant_gz3_ig_vz_il_od_bv05w_xzVDaE":{"type":"instant-Gz3IGVzIlOdBV05w","name":"[Noma] About - Hero","settings":{"text_NbQXfT0Ri4VsHbvI":"<p>About Poseidon Animal Health<\/p>","text_DytbvTo3ZG6SVaFj":"<p>Join us on our mission to help your horses and dogs live a healthier, happier life.<\/p>","padding_top":0,"padding_bottom":0}},"instant_ld_b_wmh_o1f07_jj35_x_RPgLd3":{"type":"instant-ldBWmhO1f07Jj35X","name":"[Noma] About - Intro","settings":{"text_8PpCjPD4nFeV9SAk":"<p>It All Started With A Gut Feeling<\/p>","text_UgW25ugTKTfLVNgs":"<p>At Poseidon Animal Health, we believe in animals living their best life, starting with their gut. Our mission is simple but powerful: to make high-quality, evidence-based gut health supplements that support long-term wellbeing, from their first breath to their golden years.<\/p>","text_YEiqrT4m3n8PpBty":"<p>When our founder, Linda Goldspink-Lord, was navigating a life-altering health crisis, she turned to gut health as a last resort. What started as a personal wellness experiment soon became something far more powerful - she didn’t just recover physically; she regained clarity and resilience. <\/p><p><\/p><p>The change was profound.<\/p><p><\/p><p>At the same time, she was caring for a retired racehorse named Cruz who was struggling with behavioural and health issues. The question came naturally: if supporting gut health transformed Linda’s body and mind… could it do the same for her horses and dogs?\u2028<\/p><p>That question lit the spark that would become\u2028Poseidon Animal Health.<\/p>","padding_top":0,"padding_bottom":0}},"instant_tdy94_og_lr_uel1v_cw_zaaF9i":{"type":"instant-Tdy94OGLrUEL1vCw","name":"[Noma] About - Message","settings":{"text_SRPOv3MXUJB7xrbW":"<p>The Message of Gut Health is Spreading<\/p>","text_5VJcygw1354iXngq":"<p>Poseidon began when Founders Linda Goldspink-Lord and Peter Lord started trialling evidence-based gut health formulations on their own horses, a journey that has since taken their message to an international audience.<\/p><p><\/p><p>We now have teams in the United States, Australia and New Zealand and our products are used by thousands of Veterinarians, Olympians, Dog Owners, Elite Equine Athletes, Trainers, Breeders and Horse Owners throughout the world.<\/p>","text_SkewXbfFatpvzwfP":"<p>Made in Australia<\/p>","text_LU3dczHvzivCgNit":"<p>Science-backed<\/p>","text_DeYRq8KQT9rzARfp":"<p>Veterinarian-recommended<\/p>","padding_top":0,"padding_bottom":0}},"instant_cym_bh_jh_bi_cu_on_t_ux_FrRHCx":{"type":"instant-CymBhJhBICuOnTUx","name":"[Noma] About - Experts","settings":{"text_WtW9M1fYzagNpHMo":"<p>Meet the Experts of Poseidon<\/p>","text_7K1x5uBttwwBjm7e":"<p>The Poseidon Animal Health team posesses a collective wealth of experience across the fields of small animal and equine veterinary work, canine and equine nutrition, horse breeding, training and competing. <\/p><p>Our senior management team and consultants come from animal health, veterinary, pharmaceutical and education\/training sectors.<\/p>","text_QpcI2bcD3mQPxSMX":"<h3>DR ERIN RODDY<\/h3>","text_qlYjVymoaCwnwsz0":"<h3>Chief Veterinary Officer<\/h3>","text_LsrXZ4JeB6ysOafj":"<p>Erin has always been interested in Equine Nutrition and particularly in the role that nutrition plays in Equestrian Performance and Disease. She is passionate about researching the science behind Equine Nutrition and Gut Health and the outcome different feeding strategies and practices can have on behavior, development, performance and disease.<\/p>","text_Wt59tglx9tu2q11a":"<h3>DR CHRIS MORTENSEN<\/h3>","text_R842ekpkSCovHTZ8":"<h3>Head of Education, PhD, Equine Nutritionist<\/h3>","text_OthdenTPkvio68W3":"<p>Dr. Chris J. Mortensen earned his PhD in Animal Science from Texas A&M University in animal physiology. With a career spanning academia, industry, and public outreach, Dr. Mortensen is an international recognized educator and scientist. His expertise in equine nutrition, reproductive physiology, and education has led to numerous peer-reviewed publications, international speaking engagements, and the development of widely recognized online courses. Dr. Mortensen is also recognized internationally for his All Creatures, Mad About Horses, and The Equine Connection podcasts. <\/p>","text_jCdmcp60ERCzFOj3":"<h3>DR MANDY FINNIMORE<\/h3>","text_KKYdKLk9es1kv5Dx":"<h3>Independent Veterinary Consultant<\/h3>","text_AayI1rCXMmuexWAl":"<p>Dr. Finnimore, a University of Queensland Honours graduate in Veterinary Science (1994), founded WestVets and has 30+ years' experience. She contributed to Biosecurity Queensland's responses to Equine Influenza and Hendra Virus. An FEI dressage competitor, she now offers consultancy focused on preventative care and animal wellness, with a strong focus on education and both equine and small animal health.<\/p>","text_G8aqfUdhjZumcWL1":"<h3>DR TIFFANY HALL<\/h3>","text_kafXUYArcTtsiXUB":"<h3>Veterinarian<\/h3>","text_QlrgMmzpB6iGScug":"<p>A graduate of North Carolina State Univerisity, Dr. Tiffany Hall completed residency training in Internal Medicine at the University of California in Davis.  Working in veterinary medicine from the age of 15, Dr. Hall gained unique experience in the equine industry working in Thoroughbred rehabilitation and as a hospital technician. Dr. Hall joins the Poseidon Animal Health team having worked with horses of all breeds and disciplines as an Internal Medicine Specialist in Texas, Ocala, FL and Lexington, KY.  She lives in Ocala, FL with her husband and son.  <\/p>","text_WvmKrNX4WvnjAkOP":"<h3>NIKITA STOWERS<\/h3>","text_RrC55RemwnCf4uA0":"<h3>Equine Nutritionist<\/h3>","text_2slHGwkK22UFxObS":"<p>Nikita has worked as an Equine Nutritionist in Australia, New Zealand, Japan, Hong Kong and Singapore for over 12 years.  In 2016, alongside Equine Veterinarian, Dr. Petra Hazlitt, she developed New Zealand’s first Veterinary and Nutritional integrative consultancy - Veterinary and Nutritional Integration LTD (VANI). Nikita also works as an equine nutrition consultant for Poseidon Animal Health and FeedXL.<\/p>","padding_top":0,"padding_bottom":0}},"instant_gy_po0fz_ctv_sos6_ht_haphyP":{"type":"instant-GYPo0fzCtvSos6HT","name":"[Noma] About - CTA","settings":{"text_SzIkZa83JDACQBh5":"<p>Put Gut Health First<\/p>","text_qNO6FLw6XoYTMxsL":"<p>Join the Gut Health movement.<\/p><p>Together, we can make a positive impact on the health and happiness of animals everywhere.<\/p>","url_1V9RzskdPj7FTcxE":"shopify:\/\/collections\/horse-dog-supplements","text_Iea37LF6elChPDOL":"<p>SHOP NOW<\/p>","url_dq0vmQFwnCaxYTU0":"shopify:\/\/pages\/science-gut-health","text_1dCz30hVoBp9wjoB":"<p>OUR SCIENCE<\/p>","padding_top":0,"padding_bottom":0}}},"order":["main","instant_gz3_ig_vz_il_od_bv05w_xzVDaE","instant_ld_b_wmh_o1f07_jj35_x_RPgLd3","instant_tdy94_og_lr_uel1v_cw_zaaF9i","instant_cym_bh_jh_bi_cu_on_t_ux_FrRHCx","instant_gy_po0fz_ctv_sos6_ht_haphyP"]}